public class Main {
    public static void main(String[] args) {
        int amount = 1200;
        int ruble = 20;
        int bonusmile = 1;
        int bonus = amount / ruble * bonusmile ;
        System.out.println(bonus);
    }
}


        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран

